[
    {
        "title": "Bikewatching",
        "year": 2025,
        "image": "https://drive.google.com/thumbnail?id=1oi_FMmEbyL2PsFnJfA1-saaHKZWDmfbb",
        "description": "This project visualizes Bluebikes traffic data in the Boston metropolitan area using Mapbox GL JS and D3.js. The interactive map displays bike stations, bike lanes, and traffic patterns across different times of the day. Each station is represented by a circle whose size and color provide meaningful insights into traffic volume and flow direction.",
        "link": "https://zeyuedwardqi.github.io/bikewatching/"
    },
    {
        "title": "League of Legends",
        "year": 2024,
        "image": "https://drive.google.com/thumbnail?id=15NXn3o_M0o6GcdTBRPUSC1DzdGOaeALw",
        "description": "The project includes various parts of analysis, starting from exploratory data analysis to hypothesis testing, creation of baseline and final models, and concluding with fairness analysis. The primary focus of the project is to investigate influence of gold metrics in League of Legends in 2018 by evaluating matches and impact on match statistics and outcomes.",
        "link": "https://zeyuedwardqi.github.io/League-of-Legends-Project/"
    },
    {
        "title": "Study Hours",
        "year": 2024,
        "image": "https://drive.google.com/thumbnail?id=1JrQVWwZsVts7AJYRU7MdSE6wlH8whGZe",
        "description": "Our project examines relationships between class recommendation rates and average grades, and study hours and average grades in STEM courses at UCSD (2007–2023). After scraping, cleaning, and normalizing data, we used visualizations and OLS regression analysis, finding a weak positive correlation between recommendations and grades, and a weak negative correlation between study hours and grades."
    },
    {
        "title": "Large Language Models",
        "year": 2024,
        "image": "https://drive.google.com/thumbnail?id=1K-F2T00BjEYccg5BwlAR4tBZZg81gL12",
        "description": "This project explores the development and analysis of language models, focusing on understanding how they process and generate text. It involves implementing key components of language models, such as tokenization, probability estimation, and text generation techniques. Through coding and analysis, the project aims to demonstrate how language models predict word sequences based on learned patterns, highlighting their applications in natural language processing tasks."
    },
    {
        "title": "Loans",
        "year": 2024,
        "image": "https://drive.google.com/thumbnail?id=17e8S39r9KbUKmh0wuxywHTyatDPE55ni",
        "description": "This project focuses on analyzing loan application data to uncover patterns and insights related to loan approvals and denials. The primary objective is to explore relationships between various applicant features and loan outcomes, handling challenges such as missing data and potential biases in the dataset. Through implementing data cleaning, exploratory data analysis, and statistical reasoning, the project aims to draw meaningful conclusions about the factors that influence loan decisions."
    },
    {
        "title": "Image Processing",
        "year": 2022,
        "image": "https://drive.google.com/thumbnail?id=1hJbDl3IYgNf0odcdsmVzbDUDyEwqXibN",
        "description": "This project involved developing an image processing application in Python, emphasizing object-oriented programming, algorithmic efficiency, and machine learning. It features a custom 3D matrix for RGB images with robust pixel manipulation methods and error handling. Key functionalities include grayscale conversion, rotation, brightness adjustment, and blurring, optimized with list comprehensions. The app supports standard and premium versions through class inheritance, adding features like chroma-keying and edge highlighting. A K-Nearest Neighbors classifier was also implemented for image classification."
    },
    {
        "title": "Financial Distress Paper",
        "year": 2022,
        "image": "https://drive.google.com/thumbnail?id=1PYDICqEOC1Tt0cvmXiIkF6hJhGNRBDWH",
        "description": "This paper is a survey on the efficiency and financial distress of bankrupt institutions. This paper is divided into three parts: theoretical summary, empirical literature summary and discussion. A total of 11 papers on bankruptcy and financial distress are extracted and summarized, and the most important papers for this paper are discussed and selected.",
        "link": "https://www.atlantis-press.com/proceedings/icedbc-23/125991342"
    },
    {
        "title": "Occupation of Japan",
        "year": 2021,
        "image": "https://drive.google.com/thumbnail?id=1atzR0DCHVCWlZrrZZ0uSUAiEqpFcEA6p",
        "description": "This paper examines the post-World War II Allied occupation of Japan, focusing on political, economic, and social reforms. It highlights key changes such as the new constitution, land redistribution, and educational restructuring, while analyzing the challenges of economic recovery and political stability. The paper concludes by discussing how these reforms shaped Japan's emergence as a peaceful and prosperous nation.",
        "link": "https://www.amazon.com/dp/B09F1G1HBV?ie=UTF8&*entries*=0&viewID=&*Version*=1"
    }
]